Repository: travislondon/CTD
Catalog: Application/Shared/*.lproj/Localizable.strings
Languages: de, ja

source: Finished?
de: Fertig?
ja: 完成しましたか?

source: Player One
de: Spieler Eins
ja: プレーヤー1

source: Player Two
de: Spieler Zwei
ja: プレーヤー2

source: Easy
de: Einfach
ja: 簡単

source: Hard
de: Hart
ja: ハード

source: CountDown
de: Beginnend in
ja: 始まる

source: Game Complete
de: Spiel komplett
ja: ゲームの完了

source: Pass
de: Bestehen
ja: パス

source: Retry
de: Wiederholen
ja: リトライ

source: Did not connect the dots!
de: Nicht die Punkte verbinden!
ja: ドットをつなぎませんでした!

source: Successfully connected the dots!
de: Erfolgreich die Punkte verbunden!
ja: ドットの接続に成功!

source: Give Up
de: Gib auf
ja: あきらめる

source: Reset
de: Zurücksetzen
ja: xリセット

source: Choose a name for the dot graph
de: Wählen Sie einen Namen für den Punktgraphen
ja: ドットグラフの名前を選択する

source: HelpContents
de: Betriebsarten: Herausforderung --------------- Im Challenge-Modus laden Sie vorgefertigte Punktdiagramme, dann fordern Sie sich zu versuchen und realisieren das Originalbild. Kreierung --------- Erstellen Sie Ihre eigenen Punktbilder und speichern Sie sie im Challenge-Modus. Spieler gegen Spieler Aufrechtzuerhalten. Abwechselnd mit einem Freund, der Bilder erstellt und die erstellten Punktgraphen löscht. Verwenden Sie den einfachen Modus, um eine kurze Vorschau des Bildes vor dem Lösen zu geben, oder versuchen Sie die harte Weise, ohne irgendwelche Linien aus dem Originalbild zu sehen. Verwendung: Punkt- und Linienerstellung --------------------------- Tippen Sie auf eine beliebige Stelle im Display, um einen Punkt zu erstellen. Schieben Sie von einem Ort zum anderen auf dem Display, so dass Punkte auf dem Weg. Tippen Sie an einer gewünschten Stelle auf dem Display nach unten und verwenden Sie eine andere Fingerspitze zu einem Zielort. Zeilen werden automatisch erstellt. Eine spezifische Linie kann erstellt werden, indem Multitouch zwischen zwei vorhandenen Punkten verwendet wird. Bedienelemente -------------- Reset - Alle gezeichneten Linien und Punkte löschen (nur Linien werden gelöscht, wenn nicht im Erstellungsmodus). Einfach / Hart - Stellen Sie die Schwierigkeit für den aktuellen Modus ein. Herausforderung und Spieler gegen Spieler zeigen eine kurze Ansicht des gezeichneten Punktdiagramms. Fertig? - Im Challenge-Modus vergleichen Sie die erwartete Lösung mit Ihrem und zeigen die Ergebnisse an. Im Player vs Player-Modus wird dies die Zeilen bei der Erstellung zu entfernen, berühren Ende wieder wird dann vergleichen Sie die erwartete Lösung mit der gegnerischen Lösung. Während des Erstellungsmodus wird Ihnen ein Dialogfeld angezeigt, in dem Sie das erstellte Bild zum Speichern benennen können. Load - Im Challenge - Modus können Sie einen vorgefertigten Graphen auswählen, der auf das Display geladen werden soll. Löschen - Im Erstellungsmodus können Sie zuvor erstellte Punktdiagramme von Ihrem Gerät löschen.
ja: モード： チャレンジ -------- チャレンジモードでは、事前に作成されたドットグラフを読み込み、オリジナルのイメージを試してみてください。 創造 -------- 独自のドットイメージを作成し、チャレンジモードで使用するために保存します。 プレーヤー対プレーヤー ------------------ イメージを作成し、作成したドットグラフを解決する友人と交代してください。イージーモードを使用して、解決する前に画像の短いプレビューを表示するか、元の画像から線を見ずに苦労して試してみてください。 使用法： ドットとラインの作成 ---------------- ディスプレイ上の任意の場所をタッチしてドットを作成します。 ディスプレイ上のある場所から別の場所にスライドし、道に沿って点を作成します。 別の指で指先をタッチして目的の場所に移動し、ディスプレイ上の目的の場所をタッチします。 線は自動的に作成されます。既存の2つのドットの間でマルチタッチを使用すると、特定のラインを作成できます。 コントロール ---------- リセット - 描画されたすべての線とドットを消去します（作成モードでない場合は線のみが消去されます）。 簡単 / ハード - 現在のモードの難易度を設定します。チャレンジとプレーヤーvsプレーヤーは、解決されたドットグラフの簡単な表示を示します。 完成しましたか？ - チャレンジモードでは、これはあなたの期待される解決策を比較し、結果を表示します。プレーヤー対プレーヤーモードでは、これは作成中にラインを削除し、もう一度フィニッシュをタッチすると、予想される解決策を対戦相手の解決策と比較します。作成モードでは、保存するために作成したイメージに名前を付けるダイアログが表示されます。 ロード - チャレンジモードでは、ディスプレイにロードするために事前に作成したドットグラフを選択できます。 削除 - 作成モードでは、デバイスから事前に作成されたドットグラフを削除できます。
